bscopix/Ble_Mesh_Kp/STM32_WPAN/App/p2p_server_app.c
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/

void P2PS_Send_Raw_Notification(void)
{
   if(P2P_Server_App_Context.RawNotification_Status){
    //APP_DBG_MSG("-- P2P APPLICATION SERVER  : INFORM CLIENT BUTTON 1 PUSHED \r\n ");
    //APP_DBG_MSG(" \n\r");
    P2PS_STM_App_Update_Char(P2P_NOTIFY_RAW_CHAR_UUID, (uint8_t *)&P2P_Server_App_Context.RawTargetToNotification, NOTIFY_RAW_SIZE);
   } else {
    APP_DBG_MSG("-- P2P APPLICATION SERVER : CAN'T INFORM CLIENT -  NOTIFICATION DISABLED\r\n ");
   }
  return;
}
void P2PS_Send_Shot_Notification(void)
{
   if(P2P_Server_App_Context.ShotNotification_Status){
    //APP_DBG_MSG("-- P2P APPLICATION SERVER  : INFORM CLIENT BUTTON 1 PUSHED \r\n ");
    //APP_DBG_MSG(" \n\r");
    P2PS_STM_App_Update_Char(P2P_NOTIFY_SHOT_CHAR_UUID, (uint8_t *)&P2P_Server_App_Context.ShotToNotification, NOTIFY_SHOT_SIZE);
   } else {
    APP_DBG_MSG("-- P2P APPLICATION SERVER : CAN'T INFORM CLIENT -  NOTIFICATION DISABLED\r\n ");
   }
  return;
}
void P2PS_Send_Target_Notification(void)
{
  if(P2P_Server_App_Context.TargetNotification_Status){
    //APP_DBG_MSG("-- P2P APPLICATION SERVER  : INFORM CLIENT BUTTON 1 PUSHED \r\n ");
    //APP_DBG_MSG(" \n\r");
    P2PS_STM_App_Update_Char(P2P_NOTIFY_TARGET_CHAR_UUID, (uint8_t *)&P2P_Server_App_Context.TargetToNotification, NOTIFY_TARGET_SIZE);
   } else {
    APP_DBG_MSG("-- P2P APPLICATION SERVER : CAN'T INFORM CLIENT -  NOTIFICATION DISABLED\r\n ");
   }
  return;
}

static void P2PS_Send_Ctl_Response(uint8_t request_opcode, uint8_t status, const uint8_t *payload, uint8_t payload_len)
{
  uint8_t response[P2P_CTRL_MAX_WRITE_LEN];
  uint8_t tx_len = (uint8_t)(3U + payload_len);

  if (tx_len > sizeof(response))
  {
    return;
  }

  response[0] = (uint8_t)(request_opcode | 0x80U);
  response[1] = status;
  response[2] = payload_len;

  if ((payload_len > 0U) && (payload != NULL))
  {
    memcpy(&response[3], payload, payload_len);
  }

  P2PS_STM_App_Update_Char(P2P_WRITE_CHAR_UUID, response, tx_len);
}

static void P2PS_Build_Provisioning_Status(uint8_t *status_payload4)
{
  uint16_t unicast;
  uint8_t is_unprovisioned;
  uint8_t runtime_active;
  uint8_t provision_result;

  runtime_active = (uint8_t)(IsProvisioningRuntimeSessionActive() ? 1U : 0U);
  is_unprovisioned = (uint8_t)((BLEMesh_IsUnprovisioned() == MOBLE_TRUE) ? 1U : 0U);

  status_payload4[0] = runtime_active;
  status_payload4[1] = (is_unprovisioned != 0U) ? 0x00U : 0x01U;

  /* In legacy GATT boot mode Mesh may be inactive; use persisted result fallback. */
  provision_result = GetProvisioningResult();
  if ((status_payload4[0] == 0x00U) && (provision_result == PROVISION_RESULT_SUCCESS))
  {
    status_payload4[1] = 0x01U;
  }

  unicast = (uint16_t)BLEMesh_GetAddress();
  if (status_payload4[1] == 0x00U)
  {
    unicast = 0U;
  }

  status_payload4[2] = (uint8_t)(unicast & 0xFFU);
  status_payload4[3] = (uint8_t)((unicast >> 8) & 0xFFU);
}

static void P2PS_Process_Pending_Ctrl_Write(void)
{
  uint8_t payload_len;
  uint8_t payload_copy[P2P_CTRL_MAX_WRITE_LEN];

  if (P2P_CtrlWritePending == 0U)
  {
    return;
  }

  payload_len = P2P_CtrlWriteLen;
  if ((payload_len == 0U) || (payload_len > P2P_CTRL_MAX_WRITE_LEN))
  {
    P2P_CtrlWritePending = 0U;
    P2P_CtrlWriteLen = 0U;
    return;
  }

  memcpy(payload_copy, P2P_CtrlWritePayload, payload_len);
  P2P_CtrlWritePending = 0U;
  P2P_CtrlWriteLen = 0U;

  P2PS_Handle_Mesh_Control_Write(payload_copy, payload_len);
}

static void P2PS_Handle_Mesh_Control_Write(const uint8_t *payload, uint8_t length)
{
  uint8_t opcode;
  uint8_t declared_payload_len;
  uint8_t actual_payload_len;
  uint8_t status_payload[4U];
  uint16_t timeout_s;
  MOBLE_RESULT mesh_result;
  ModeStatus_t mode_status;
  uint8_t mode_payload[12U];
  uint8_t capability_payload[6U];
  uint32_t transition_id;
  uint32_t capabilities;

  if ((payload == NULL) || (length == 0U))
  {
    return;
  }

  opcode = payload[0];

  if (length < 2U)
  {
    P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_LENGTH, NULL, 0U);
    return;
  }

  declared_payload_len = payload[1];
  actual_payload_len = (uint8_t)(length - 2U);

  if (declared_payload_len != actual_payload_len)
  {
    P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_LENGTH, NULL, 0U);
    return;
  }

  switch (opcode)
  {
    case P2P_CTRL_OPCODE_MESH_DEPROVISION:
      if (declared_payload_len != 0U)
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_LENGTH, NULL, 0U);
        break;
      }

      if (BLEMesh_IsUnprovisioned() == MOBLE_TRUE)
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_STATE, NULL, 0U);
        APP_DBG_MSG("MESH_DEPROVISION rejected: node already unprovisioned\r\n");
        break;
      }

      if (BLEMesh_TrsptIsBusyState() == MOBLE_TRUE)
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BUSY, NULL, 0U);
        APP_DBG_MSG("MESH_DEPROVISION rejected: mesh transport busy\r\n");
        break;
      }

      mesh_result = BLEMesh_Unprovision();
      if (MOBLE_FAILED(mesh_result))
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_INTERNAL_ERROR, NULL, 0U);
        APP_DBG_MSG("MESH_DEPROVISION failed: result=%d\r\n", mesh_result);
        break;
      }

      ClearProvisioningBootRequest(PROVISION_RESULT_UNKNOWN);
      (void)ModeManager_RequestMode(BOOT_MODE_LEGACY_GATT, 0U);
      P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_OK, NULL, 0U);
      APP_DBG_MSG("MESH_DEPROVISION accepted: rebooting node\r\n");
      HAL_Delay(100U);
      NVIC_SystemReset();
      break;

    case P2P_CTRL_OPCODE_GET_PROVISIONING_STATUS:
      P2PS_Build_Provisioning_Status(status_payload);
      P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_OK, status_payload, sizeof(status_payload));
      APP_DBG_MSG("Provisioning status requested: mode=%02x prov=%02x addr=%02x%02x\r\n",
                  status_payload[0], status_payload[1], status_payload[3], status_payload[2]);
      break;

