bscopix/Ble_Mesh_Kp/STM32_WPAN/App/p2p_server_app.c
    case P2P_CTRL_OPCODE_ENTER_PROVISIONING:
      if (declared_payload_len != 2U)
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_LENGTH, NULL, 0U);
        break;
      }

      timeout_s = (uint16_t)payload[2] | ((uint16_t)payload[3] << 8);
      if (!ModeManager_RequestMode(BOOT_MODE_MESH_PROVISIONING, 0U))
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_INTERNAL_ERROR, NULL, 0U);
        APP_DBG_MSG("ENTER_PROVISIONING rejected: mode NVM write failed\r\n");
        break;
      }
      SetProvisioningBootRequest(timeout_s, PROVISION_REASON_GATT);
      P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_OK, NULL, 0U);
      APP_DBG_MSG("Provisioning boot requested via GATT (timeout=%u s)\r\n", timeout_s);
      HAL_Delay(100U);
      NVIC_SystemReset();
      break;

    case P2P_CTRL_OPCODE_CANCEL_PROVISIONING:
      if (declared_payload_len != 0U)
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_LENGTH, NULL, 0U);
        break;
      }

      ClearProvisioningBootRequest(PROVISION_RESULT_UNKNOWN);
      (void)ModeManager_RequestMode(BOOT_MODE_LEGACY_GATT, 0U);
      P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_OK, NULL, 0U);
      APP_DBG_MSG("Provisioning boot request canceled via GATT\r\n");
      break;

    case P2P_CTRL_OPCODE_MESH_HARD_FACTORY_RESET:
      if (declared_payload_len != 0U)
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_LENGTH, NULL, 0U);
        break;
      }

      ClearProvisioningBootRequest(PROVISION_RESULT_UNKNOWN);
      ClearNfcBootOpcode();

      mesh_result = Appli_MeshEraseProvisioningStorage();
      if (MOBLE_FAILED(mesh_result))
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_INTERNAL_ERROR, NULL, 0U);
        APP_DBG_MSG("MESH_HARD_FACTORY_RESET failed: erase result=%d\r\n", mesh_result);
        break;
      }

      P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_OK, NULL, 0U);
      (void)ModeManager_RequestMode(BOOT_MODE_LEGACY_GATT, 0U);
      APP_DBG_MSG("MESH_HARD_FACTORY_RESET accepted: rebooting node\r\n");
      HAL_Delay(100U);
      NVIC_SystemReset();
      break;

    case P2P_CTRL_OPCODE_ENTER_MESH:
      if (declared_payload_len != 4U)
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_LENGTH, NULL, 0U);
        break;
      }
      if (GetProvisioningResult() != PROVISION_RESULT_SUCCESS)
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_STATE, NULL, 0U);
        break;
      }
      transition_id = (uint32_t)payload[2]
                    | ((uint32_t)payload[3] << 8)
                    | ((uint32_t)payload[4] << 16)
                    | ((uint32_t)payload[5] << 24);
      if (!ModeManager_RequestMode(BOOT_MODE_MESH_OPERATIONAL, transition_id))
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_INTERNAL_ERROR, NULL, 0U);
        break;
      }
      P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_OK, &payload[2], 4U);
      APP_DBG_MSG("ENTER_MESH accepted: transition=%08lx\r\n",
                  (unsigned long)transition_id);
      HAL_Delay(100U);
      NVIC_SystemReset();
      break;

    case P2P_CTRL_OPCODE_GET_MODE_STATUS:
      if (declared_payload_len != 0U)
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_LENGTH, NULL, 0U);
        break;
      }
      ModeManager_GetStatus(&mode_status);
      mode_payload[0] = MODE_PROTOCOL_VERSION;
      mode_payload[1] = mode_status.actual_mode;
      mode_payload[2] = mode_status.requested_mode;
      mode_payload[3] = mode_status.transition_in_progress;
      mode_payload[4] = mode_status.provision_result;
      mode_payload[5] = mode_status.last_error;
      mode_payload[6] = mode_status.consecutive_unplanned_resets;
      mode_payload[7] = 0U;
      mode_payload[8] = (uint8_t)(mode_status.transition_id & 0xFFU);
      mode_payload[9] = (uint8_t)((mode_status.transition_id >> 8) & 0xFFU);
      mode_payload[10] = (uint8_t)((mode_status.transition_id >> 16) & 0xFFU);
      mode_payload[11] = (uint8_t)((mode_status.transition_id >> 24) & 0xFFU);
      P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_OK,
                             mode_payload, sizeof(mode_payload));
      break;

    case P2P_CTRL_OPCODE_GET_CAPABILITIES:
      if (declared_payload_len != 0U)
      {
        P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_LENGTH, NULL, 0U);
        break;
      }
      capabilities = ModeManager_GetCapabilities();
      capability_payload[0] = MODE_PROTOCOL_VERSION;
      capability_payload[1] = (uint8_t)(capabilities & 0xFFU);
      capability_payload[2] = (uint8_t)((capabilities >> 8) & 0xFFU);
      capability_payload[3] = (uint8_t)((capabilities >> 16) & 0xFFU);
      capability_payload[4] = (uint8_t)((capabilities >> 24) & 0xFFU);
      capability_payload[5] = P2P_CTRL_MAX_WRITE_LEN;
      P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_OK,
                             capability_payload, sizeof(capability_payload));
      break;

    default:
      P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_INTERNAL_ERROR, NULL, 0U);
      break;
  }
}
/* USER CODE END FD_LOCAL_FUNCTIONS*/
